*** find word in a file and print the line
    :LOGBOOK:
    CLOCK: [2020-03-22 Sun 17:24]--[2020-03-22 Sun 18:05] =>  0:41
    :END:
    [[~/Documents/Snippet/CPP/primer-12-3.cpp][cpp file]]

** DONE C++ Project Framework                                          :NOTE:
   CLOSED: [2020-03-31 Tue 21:41] DEADLINE: <2020-03-30 Mon 22:00>
   :PROPERTIES:
   :ID:       1D8F715F-A30B-432C-AA70-63D1FE8545E7
   :END:
   :LOGBOOK:
   CLOCK: [2020-03-05 Thu 18:12]--[2020-03-05 Thu 18:14] =>  0:02
   :END:
   [2020-03-05 Thu 18:12]

*** DONE recursive programming                                         :NOTE:
    CLOSED: [2020-03-29 Sun 21:47] SCHEDULED: <2020-03-29 Sun 20:00-21:00>
    :PROPERTIES:
    :ID:       4999E010-DE33-4CBC-AA65-1169D96F9FB4
    :END:
    - State "FINISHED"   from "CANCELLED"  [2020-03-29 Sun 21:47]
    :LOGBOOK:
    CLOCK: [2020-03-05 Thu 09:46]--[2020-03-05 Thu 09:49] =>  0:03
    :END:
    [2020-03-05 Thu 09:46]
    使用递归：每次固定操作可以减少问题的n（可能是一个多维n^m的问题）
    递归函数：如何表示n，递归操作，终止条件

    [[https://mp.weixin.qq.com/s/mJ_jZZoak7uhItNgnfmZvQ][递归及其优化参考文章]]

** DONE C++ Network Lib: asio
   CLOSED: [2020-04-15 Wed 16:04]
   :LOGBOOK:
   CLOCK: [2020-04-10 Fri 15:51]--[2020-07-02 Thu 17:38] => 1993:47
   :END:

 resource: 
 - [[http://think-async.com/Asio/asio-1.16.0/doc/][HTML documentation (non-Boost)]]

 Asio is a *cross-platform* C++ library for network and *low-level I/O programming* that provides developers with a *consistent asynchronous* model using a modern C++ approach

 Asio has two versions: standalone asio without boost; with boost

** DONE C++ string                                                     :NOTE:
   CLOSED: [2020-03-28 Sat 20:40]
   :PROPERTIES:
   :ID:       60694708-4932-4F29-AF30-E839E71A61A0
   :END:
   :LOGBOOK:
   CLOCK: [2020-03-06 Fri 09:27]--[2020-03-06 Fri 09:28] =>  0:01
   :END:
 [2020-03-06 Fri 09:27]

**** for in const string
     :LOGBOOK:
     CLOCK: [2020-03-06 Fri 10:49]--[2020-03-06 Fri 11:03] =>  0:14
     :END:
 #+begin_src C++ :includes <iostream> <string> <cctype> :namespaces std
   int main(){
       // const string str_const = "Hello World";
       string str_const = "Hello World";
       for(auto & c : str_const)
           c = toupper(c);

       cout << str_const;

       return 0;
   }
 #+end_src

 #+RESULTS:
 : HELLO WORLD

  *ps:* cannot change const string
** think about string
   :LOGBOOK:
   CLOCK: [2020-03-03 Tue 10:40]--[2020-03-03 Tue 10:45] =>  0:05
   :END:
 [2020-03-03 Tue 10:40]

** DONE thinking about recursive
   CLOSED: [2020-07-02 Thu 18:49]
   :PROPERTIES:
   :ID:       B3B9ACA2-3E58-4986-829D-75226C2D3BF5
   :END:
   :LOGBOOK:
   CLOCK: [2020-03-03 Tue 11:01]--[2020-03-03 Tue 11:03] =>  0:02
   :END:
 [2020-03-03 Tue 11:01]

